import streamlit as st

st.title("自分占い\n\n")

st.write("太陽　蟹座04度21分/1ハウス\n\n",

"[キーワード]豊かな感受性を活かす、安らげる居場所を求める、信頼関係を築く、模倣、閉鎖的、悲観的、引きこもりがち、臆病、不平不満が多く、人々に人気のある、暖かい家庭を築く、感性豊か、過去から学び、人々を包み込み\n\n",

"[太陽と蟹座[♋️:cancer]]蟹座はフィーリングを大事にし、身近な人との心のふれあいに、生きる喜びを感じる星座。ここに太陽が入っていると、信頼できる人と親密な関係を築き、安住できる巣作りをすることで安定した人生を送ります。この太陽のパワーが活かされていければ、大切な人を優しく保護し、ケアする気持ちが自然と生まれてきます。そうすることで周りから愛される人生を送ることができるのです。しかし、このパワーがマイナスに作用してしまえば、周囲との信頼関係をうまく築くことができなくて、孤立したり閉鎖的な人生になりがちに。自分に自信が持てず、不平不満の多い生き方になりやすいのです。\n\n",

"月　牡牛座03度44分/11ハウス\n\n",

"[キーワード]穏やか、おっとり、のんびり、地道、素朴、独占的、強欲、防衛的、粘り強く、忍耐強く、頑固、ねっとり、安定、義理堅く、快楽主義的、温和、現実的、鈍感、執着的、消極的、マイナス思考、すねる\n\n",

"[月と牡牛座[♉️:taurus]]牡牛座の月は、安定した状態を本能的に求めるのが特徴。落ち着いた環境や経済的に安定いた生活でないと、穏やかな感情を保てません。美味しいものを食べ、音楽、芸術を鑑賞し、心豊かに暮らすことが、一番の喜びに感じられるタイプです。この月の力が十分に働いていると、安定感のある温和な性質が表れてきます。粘り強さや忍耐力も出てくるので、ひとつのことに根気良く取り組む姿勢も見られるはず。しかし、マイナスに作用すると、のんびりしすぎて周囲から取り残されたり、安定思考になるあまり冒険を恐れがちに。粘り強さも頑固という欠点にすり替わってしまうのです。\n\n",

"水星　蟹座29度09分/1ハウス\n\n",

"[キーワード]知識を溜め込む、理性を欠き、記憶力抜群、敏感に察知、辻褄が合わない、ミーハー、世俗的、商才を発揮、殻に籠り、麻痺、引きこもり、詮索的、散漫\n\n",

"[水星と蟹座[♋️:cancer]]水星が蟹座にある人は、感情を優先して物事を判断するのが特徴。この水星のパワーがうまく働いていると、人の気持ちを敏感に察し相手の望むことを即座にしてあげられます。その能力を仕事に活かすなら、老人や子供を相手にするような職業が向いているでしょう。また、知識を溜め込む能力も備わっているので、記憶力も抜群です。反面、水星の力をうまく発揮できなければ、感情を優先するあまり論理的な思考力に欠けてきます。話の辻褄が合わないことも多くなりがちに。仕事も気分で行うので、仕上がりにムラができ、一定したクオリティを保てなくなります。\n\n",

"金星　蟹座24度48分/1ハウス\n\n",

"[キーワード]自己防衛的、相手をいたわり、母性的、ウエット、居心地が良い、家庭的、情愛が深い、周囲に左右されて、世話好き、結婚につながる恋愛、愛情を押し付ける、相手を守る、排他的、相手を甘やかす、嫉妬深い、尽くし型、泥沼\n\n",

"[金星と蟹座[♋️:cancer]]好きになったら何があっても相手を守り、母性的な愛で尽くそうとするのが、金星が蟹座にある人の恋愛。この金星がプラスに働いていると、相手をいたわり、ケアする気持ちが人一倍強く、懐深い愛情で相手を包み込みます。落ち込んでいる恋愛を励ましたり、マメに世話を焼いたりして、喜びも悲しみも共に分かち合える恋愛を経験できるでしょう。ところが金星のパワーが使いこなせないと、あなたの愛情は過剰になります。ベタベタし過ぎて相手に鬱陶しい思いをさせたり、恋人を甘やかし過ぎたり。そして相手が自分と同じくらいの愛情を注いでくれないと、不満に思うようになります。\n\n",

"火星　牡羊座03度24分/10ハウス\n\n",

"[キーワード]飽きっぽく、カッとしやすい、気持ちが荒ぶった、怒りっぽい、衝動的に行動しがち、我慢の利かない、駄々っ子のような、スピーディーに、体当たり的な、一心不乱に、パワフルな、大胆な、ハンター的な\n\n",

"[火星と牡羊座[♈️:aries]]カッとなると自制心を失いやすいあなた。ハチャメチャな行動をとって、後悔することが多いかもしれません。性に関しても、勢い任せにベッドインし、体を重ねた途端に熱が冷めてしまう、と言う経験を持ちやすいでしょう。しかし、火星のパワーを上手にコントロールできるようになると、あなたは負け知らずの人生を歩んでいけるようになるはず。標的を定めたら、一心不乱かつスピーディーに突き進み、自分の目的を達することが出来るようになります。ライバルや敵を蹴落とすことも躊躇なくやって退けるでしょう。あなたには野生的な強さが秘められていると言えます。\n\n",

"木星　水瓶座11度03分(R')/8ハウス\n\n",

"[キーワード]没個性的、友達が少ない、権力に負けがち、恋に縁遠い、個性を活かせる仕事で成功する、才能を開花してくれる人物と出会う、有名人との結婚、男性中心の世界で活躍、恋人が最高の友人である\n\n",

"[木星と水瓶座[♒️:aquarius]]常識を疑ってみることから、幸運の幕が開きます。この仕事は男にしかできないというのは本当だろうか？このタイプの男性との結婚は破綻しやすいというのは事実だろうか？不意にそんな疑問が湧いてきた時こそ、あなたにしか成し得ない幸運を掴むためのチャンスなのです。水瓶座は個性と平等、博愛の精神を重んじる星座。そこに木星が位置するあなたは、社会の歪みや偏見の視線と戦う勇気を持つ人。それによって自分らしい生き方を見つけていける人です。女性初のパイロットだとか、超有名人との結婚などの常識外の幸運も、あなたにとっては夢ではないはず。\n\n",

"土星　双子座25度30分/12ハウス\n\n",

"[キーワード]得意な仕事で挫折する、初等教育で躓く、好きな相手に馬鹿にされる、受験で失敗する、頭を使って、情報収集に努め、好奇心旺盛に、大人になっても勉強を続けることで、見聞を広めながら\n\n",

"[土星と双子座[♊️:gemini]]知的好奇心の強い双子座に土星が位置しているあなたは、勉強につまずいたり、情報に乗り遅れたりすることに密かな恐れを感じやすい人です。そのため、志望校に落ちたことなどがコンプレックスになりやすく、人前では何かと「知ったかぶり」をすることで、知識のなさを誤魔化そうとする傾向が出る場合も。しかし土星の位置する星座の性質は、うまくいかせば強みとなるもの。学生時代のコンプレックスを拭うために、もう一度大学へ入るとか、学校では得られない生の情報を知るために、各地を旅行して知識を深めたリすれば、知的分野で大きな成功を収めるかもしれません。\n\n",

"天王星　天秤座18度55分(R')/4ハウス\n\n",

"[キーワード]特になし。\n\n",

"[天王星と天秤座[♎️:libra]]美意識に優れた天秤座にある天王星は、あなたにかなり個性的な美的感覚を与えるかもしれません。自分がいいと思うものが、他人には受け入れられないことがあるはずです。ただ、それにめげることなく、大切に自分の感覚を育んでいくならば、あなたはファッションや建築界の改革者となるかもしれません。でも、美的感覚が重視しされる分野以外での社会的な改革には、あまり反応を示さないでしょう。\n\n",

"海王星　射手座05度18分(R')/6ハウス\n\n",

"[キーワード]特になし。\n\n",

"[海王星と射手座[♐️:sagitarius]]探究心の強い射手座に海王星が位置すると、まだ見ぬ世界に対する憧れが強まります。そのため、この世代は、放浪の旅を続けるような生き方に憧れの気持ちを向けやすく、冒険家を産む土壌を育みます。壮大な宇宙旅行への期待や憧憬(どうけい)を持つ人も多くなるでしょう。ただ、閉塞感の強い社会では、この世代からの不満の声が上がりやすく、社会制度や風習を崩壊しようとする気運が高まるようになるでしょう。\n\n",

"冥王星　天秤座01度43分/4ハウス\n\n",

"[キーワード]特になし。\n\n",

"[冥王星と天秤座[♎️:libra]]愛と美の女神、ヴィーナスを支配星とするエレガントな天秤座。この星座に冥王星が入っている時代には、愛すべき存在、美しい遺産や街を喪失するという、悲嘆的な出来事が人々を襲うかもしれません。そして、その追悼の気持ちが世界のあり方や、人々の生き方を変えることになるでしょう。痛ましい出来事を通じて、人は悲しみを共有し、励ましあうこと、支えあうことの尊さに気づくのかもしれません。\n\n")